Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K29.tmx
Source language: en_us
Languages: zh_cn

source: Miracle Polish
zh_cn: 神奇光亮剂

source: I should have said no to the stranger at the door, with his skinny throat and his black sample case that pulled him a little to the side, so that one of his jacket cuffs was higher than the other.
zh_cn: 我本该拒绝门口那个陌生人的请求。那个陌生男人的喉结很深，肩上还背着个黑色的样品箱，箱子非常沉，坠得他稍稍向一边倾斜，你明显能看到他上衣袖口的一边比另一边高出许多。

source: A polite no would have done the trick, no thanks, I'm afraid not, not today, then the closing of the door and the heavy click of the latch, but I'd seen the lines of dirt in the black shoe creases, the worn-down heels, the shine on the jacket sleeves, the glint of desperation in his eyes.
zh_cn: 其实，一句礼貌的拒绝就能解决问题，“不，今天我不需要”，然后就可以顺理成章地关上门，再重重地插上门栓。但是当我看到他黑色皮鞋上深深的褶皱和灰尘、已经破损的鞋邦、磨得油渍的袖头，和一双绝望的眼睛时，我就对自已说，还是让他进来吧。

source: All the more reason, I said to myself, to send him on his way, as I stepped aside and watched him move into my living room.
zh_cn: 最后，我还是退到了一旁，看着他走进了客厅。

source: He looked quickly around before setting his case down on the small table next to the couch.
zh_cn: 进屋后，他先扫视了一下周围，接着把箱子放在沙发旁的小桌子上。

source: I'd made up my mind to buy something from him, anything, a hairbrush, the Brooklyn Bridge, buy it and get him out of there.
zh_cn: 事已如此，我只能决定从他那买点儿什么东西，例如布鲁克林大桥牌毛刷等任何一样东西，最后他就可以走了。

source: I had better things to do with my time, but there was no hurrying him as he slowly undid each clasp with his bony fingers and explained in a mournful voice that this was my lucky day.
zh_cn: 我还有更好的方式去打发我的时间，但是显然，他一点儿都不着急。他慢慢地舒缓了一些，皮包骨似的手指也不再紧紧地纂着，接着他悲凉地向我解释说，今天是我的幸运日。

source: In the suddenly opened case I saw six rows of identical dark-brown glass bottles, each a bit smaller than a bottle of cough medicine.
zh_cn: 他快速地打开盒子，我看到六排一模一样的棕褐色玻璃瓶，每个瓶子的大小只比止咳药水的瓶子小一点。

source: Two things struck me: the case must have been very heavy, and he must not have sold anything in a long time.
zh_cn: 看到这些东西后，我有些触动，一是箱子很沉，二是他好像好长时间都没有卖出一件。

source: The product was called Miracle Polish. It cleaned mirrors with one easy flick of the wrist.
zh_cn: 他说他的这些产品叫做神奇光亮剂，只要使用这种光亮剂并轻轻转动手腕擦拭镜子，就可以让它们光亮如新。

source: He seemed surprised, even suspicious, when I said I'd take one, as if he had wandered the earth for years with the same case filled to bursting with unsold bottles.
zh_cn: 当我说我要买一瓶光亮剂时，他看起来非常惊讶，甚至有些不敢相信自已的耳朵，就好像他已经拎着装满瓶子的箱子在地球上转悠了好几年，但是却连一瓶光亮剂都没卖出去。

source: I tried not to imagine what would drive a man to go from house to house in a neighborhood like this one, with porches and old maples and kids playing basketball in driveways, a neighborhood where Girl Scouts sold you cookies and the woman across the street asked you to contribute to the leukemia drive, but no strangers with broken-down shoes and desperate eyes came tramping from door to door lugging heavy cases full of brown bottles called Miracle Polish.
zh_cn: 我已经能想像得到，这个男人如何在这个社区里从一家走到另一家。在我们社区里能看到在门廊、老枫树和在汽车车道上玩球的孩子们，向你出售零食的女童军，还有在街对面为了治疗患白血病要求你捐款的妇女。我们这儿什么人都有，就是从未出现过像他这样的陌生男人。他的鞋跟已经破损，一双眼睛充满着绝望，他还背着重重的箱子，敲着每家的门，贩卖那些叫做神奇光亮剂的东西。

source: The name exasperated me, a child could have done better than that, though there was something to be said for the way it sat there flaunting its fraudulence. "Don't trust me!" it shouted for all to hear. "Don't be a fool!"
zh_cn: 这个东西的名字让我有些恼火，就连小孩子都会对叫这种名字的产品有些怀疑。他坐在那里炫耀他的诓骗技巧，我却只能听他自说自话而什么都不能做，“不要相信他”，所有人都会听到这种警告的声音，“不要当个白痴”。

source: When he tried to sell me a second bottle, he understood from my look that it was time to go.
zh_cn: 当他还想卖给我第二瓶光亮剂时，从我的表情中可出读出对他的警告——你该走了。

source: "You've made a wise choice," he said solemnly, glancing at me and looking abruptly away.
zh_cn: “你的选择很明智”他很认真地对我说，然后看了看我，又突然把目光移开。

source: Then he clicked his case shut and hurried out the door, as if afraid I'd change my mind.
zh_cn: 最后，他咔哒一声关上了箱子，匆匆地走出了房门，就好像担心我会改变主意。

source: Lifting a slat of the half-closed blinds, I watched him make his way along the front walk with the sample case pulling him to one side.
zh_cn: 等他走后，我撩起半开着的百叶窗，从缝隙里我看着他走到了甬路上，沉甸甸的样品箱拽着他的身子正往一边倾斜。

source: At the sidewalk he stopped, put down his case next to the sugar maple, wiped his jacket sleeve across his forehead, and gazed up the block as if he were the new boy in school, getting ready to cross the school yard, where faces were already turning to stare at him.
zh_cn: 当他走到人行道时，他把箱子放在了糖枫树的一边儿，又用外套的袖子擦拭了一下额头，然后他又开始凝视着街道的四周，他就像刚入学的新生，正准备穿越学校的操场，而且操场上还有好多人正看着他。

source: For a moment he looked back at my house.
zh_cn: 这时侯，他突然回过头来向我的房间张望了一下。

source: When he saw me watching him, he grinned suddenly, then frowned and jerked his head away. With a sharp snap I let the blind-slat drop.
zh_cn: 当他看到我正在瞧他时，他咧开嘴笑了笑，然后又皱皱眉，最后他的头向旁边一扭转过身走了，这时我立刻放下了百叶窗的叶片。

source: I had no interest in mirror polish.
zh_cn: 我对这瓶光亮剂并不感兴趣。

source: I placed the bottle in a drawer of the hutch, where I kept extra flashlight batteries, packages of light bulbs, and an unused photograph album, and gave no more thought to it.
zh_cn: 我把它放在贮藏箱里后，就再没有想起过它。这个箱子里放着很多用不着的东西，如电池、灯炮和没有用的相册等。

source: Early one morning, a week or so later, I stepped over to the oval mirror in the upstairs hall, as I did every morning before leaving for work.
zh_cn: 一周之后的某一天早晨，我站在楼上大厅椭圆形的镜子前面照镜子，就如我每天早晨准备离开家去工作时一样。

source: As I tugged down the sides of my suit jacket and smoothed my tie, I noticed a small smudge on the glass, near my left shoulder.
zh_cn: 我整理着我的外套，抚平我的领带，突然，我发现我左肩旁的镜子上粘着一大块污垢。

source: It had probably been there for years, ever since I'd brought the mirror down from my parents' attic, along with a faded armchair and my grandmother's couch with the threadbare arms.
zh_cn: 镜子和我父母褪了色的扶手椅、祖母的沙发一同从阁楼里搬出来后，这块污渍就一直在上面。

source: I tried to recall whether I had ever cleaned the oval mirror before, whether I had ever bothered to dust the old mahogany frame carved with leaves and flowers.
zh_cn: 同样，我也回忆着这块椭圆形的镜子是否曾经擦拭过，是否清洁过雕刻着芳草和鲜花的老红木相框。

source: I understood that I was having these thoughts only because of the stranger with the bony fingers and the worn-down heels, and as I went down to the hutch I felt a burst of irritation as I heard him say, "This is your lucky day."
zh_cn: 我知道，突然间想这件事儿，完全是因为手我想起了那个手指瘦骨嶙峋、鞋跟磨破了的那个陌生人。当我来到储藏室并想起他说的“今天是你的幸运日”这句话时，一股愤怒之情就油燃而升。

source: Upstairs I pulled a tissue from the box in the bathroom and unscrewed the top of the brown bottle.
zh_cn: 上楼后，我从盥洗室中的面巾盒子里拿出了一块纸巾，旋即拧开棕色瓶子的盖子。

source: On the dark glass, in white capital letters, stood the words "MIRACLE POLISH."
zh_cn: 黑乎乎的瓶子上用白色墨迹写着几个大字——“神奇光亮”。

source: The liquid was thick, slow, and greenish white.
zh_cn: 光亮剂是一种很沾稠、呈白绿颜色的液体。

source: I applied a bit to the tissue and wiped the smudge.
zh_cn: 接着我在纸巾上倒了点光亮剂，然后开始擦拭镜子上污迹。

source: When I lifted my hand I was almost disappointed to see that the spot was gone.
zh_cn: 当我把手抬起来时，我有些失望地发现光亮剂很快就用完了。

source: I was aware of another thing: the rest of the mirror looked dull or tarnished.
zh_cn: 然后，我又发现镜子的其它地方也很脏。

source: Had I really never noticed it before? With another dab of polish I set to work wiping the entire surface, right up to the curves of the frame.
zh_cn: 难道我以前从没有注意到过这些细节吗？接着我又在纸巾上倒了些光亮剂开始擦拭整面镜子和旁边镶嵌的镜框。

source: It was done quickly; I stepped back for a look.
zh_cn: 快速地擦完镜子后，我还向后退了几步仔细检查镜子是否已经干净。

source: In the light from the overhead bulb with its old glass shade, mixed with sunlight from the window on the nearby landing, I saw myself reflected clearly.
zh_cn: 我头上古老的玻璃电灯炮发出的幽暗光亮混和楼梯口旁窗户外透出的太阳光，我的影像就这样清晰地反射在镜子里。

source: But it was more than that. There was a freshness to my image, a kind of mild glow that I had never seen before.
zh_cn: 不仅仅我看到了镜子中的自已，而且镜子中的形像还清新可见，周围还泛出我从未看到过的一圈柔和的光晕。

source: I looked at myself with interest.
zh_cn: 就这样，我饶有兴致地看着镜中的自已。

source: This in itself was striking, for I wasn't the kind of man who looked at himself in mirrors.
zh_cn: 我不是经常照镜子的那种人，但是能在镜子中仔细看看自已的模样还是很有趣的。

source: I was the kind of man who spent as little time as possible in front of mirrors, the kind of man who had a brisk and practical relation to his reflection, with its tired eyes, its disappointed shoulders, its look of defeat.
zh_cn: 我不喜欢照镜子，只是有需要时我才拿出镜子照一照。我对自已镜中的形像再熟悉不过了，我知道我的双眼疲惫、双肩下垂，怎么看都有一股晦暗之色。

source: Now I was standing before a man who resembled my old reflection almost exactly but who had been changed in some manner, the way a lawn under a cloudy sky changes when the sun comes out.
zh_cn: 实际上，镜子中的我依然是老样子，只是在某些地方发生了一些改变，就像太阳出来时，灰暗的天空下的草地顿时生机勃勃。

source: What I saw was a man who had something to look forward to, a man who expected things of life.
zh_cn: 不知为什么，现在镜中的我已经开始期待某种东西，期待生命中发生的某些变化。

source: That afternoon when I returned from work, I went up to the oval mirror.
zh_cn: 那天下午，当我工作结束回到家时，我径直走到了镜子前。

source: In the polished glass I was struck again by a sense of freshness.
zh_cn: 在光亮如新的镜子前面，我又一次被那种清晰明了的感觉所触动。

source: Had the mirror really been so deeply in need of cleaning?
zh_cn: 难道镜子真的需要擦拭吗？

source: There were three other mirrors in the house: the mirror over the sink in the upstairs bathroom, the mirror over the sink in the downstairs half bath, and the small circular mirror with a wooden handle that hung on a hook beside the upstairs-bathroom window.
zh_cn: 我的房子里还有三面镜子：楼上浴室的盥洗盆上方有一面镜子、楼下盥洗室的面盆上方有一面镜子、楼上浴室窗子旁边的挂钩上挂着一面有木制圆形手柄的小镜子。

source: None of them had seemed to need cleaning before, but when I was through with them I saw my new reflection glowing back at me from all three.
zh_cn: 以前，这三面镜子似乎根本不需要擦拭，但是当我清洁完这三面镜子时，我又从这三面镜子中看到了我的新形像。

source: I looked at the brown bottle of Miracle Polish in my hand.
zh_cn: 然后，我拿起在手中的光亮剂开始观察着它们。

source: It seemed an ordinary bottle, a bottle like any other.
zh_cn: 看起来这只是一瓶普通的光亮剂，和其它光亮剂没有什么特殊之处。

source: If the polish had made me look younger, if it had made me handsome, if it had smoothed my skin and fixed my teeth and changed the shape of my nose, I'd have known it was some horrible mechanical trick, and I'd have smashed those mirrors with my fists rather than allow myself to be taken in like a fool.
zh_cn: 如果光亮剂真的能使我看起来年轻、英俊，真的能使我的皱纹消失、修补牙齿、改变鼻子形状，那么我就会认为这只是个可怕的小把戏，我就会用拳头把镜子砸碎，而不是让它把我变成一个随便被人愚弄的傻瓜。

source: But the image in the mirror was unmistakably me - not young, not good-looking, not anything in particular, a little slumped, heavy at the waist, pouchy under the eyes, not the sort of man that anyone would ever choose to be.
zh_cn: 但是，镜子中的我却是真实的我——不再年轻、没有相貌、没有特点、稍稍驼背、腰部发福、双眼有眼带，不是每个男人都梦寐以求想拥有的那种相貌。

source: And yet he looked back at me in a way I hadn't seen for a long time, a way that made the other things all right.
zh_cn: 不管怎样，镜子中的那个形像就这样看着，就好像我们好久不曾见面，好像事情会变得越来越好。

source: He looked back at me - the thought sprang to mind - like a man who believed in things.
zh_cn: 突然我想到，他一定是相信世界上有某种东西确实存在。

source: The next morning I woke before my alarm and hurried over to the oval mirror in the hall.
zh_cn: 第二天早晨，没等闹钟把我叫醒，我就立刻来到大厅椭圆形镜子前。

source: My image glowed back at me; even my rumpled pajamas had a certain jaunty look.
zh_cn: 我在镜子中的形像很亮丽，甚至我身上穿的褶皱的睡衣都很光鲜。

source: In the polished glass the dull walls seemed brighter, the bedroom door a richer brown.
zh_cn: 在这面光洁如新的镜子映射下，阴暗的墙面显得格外明亮，卧室的那扇门变得更加油亮光泽。

source: In the bathroom mirror I shone forth; the whiteness of the sink burned in the glass; the towels looked fuller.
zh_cn: 在洗漱室的镜子前，我的形象同样熠熠生辉，洗漱盆也变得光泽如新，手巾看起来非常饱满丰盈。

source: Downstairs, the reflected window in the half bath showed part of a brilliant curtain, beyond which lay the green grass of childhood summers.
zh_cn: 楼下盥洗室镜子里反射出的半扇窗帘美好崭新，在窗帘旁边就是夏天里稚嫩的绿草地。

source: All day at work I thought of nothing but those shining surfaces, like coins catching the sun, and when I came home I went from mirror to mirror, striking poses, turning my head from side to side.
zh_cn: 在工作时，我一整天都想着这些闪闪发光的玻璃镜面，就像我身边的事物开始展现了它阳光、健康的一面。当我回到家时，我照完一面镜子后，又开始照另外一面镜子，我还摆出一些姿势，又把头从一侧转到另一侧。

source: Because I prided myself on never having false hopes, on never permitting myself to imagine that things were better than they were, I asked myself whether I might be allowing the mirrors to deceive me.
zh_cn: 我一直很骄傲，认为自已从未有过任何不切实际的幻想，也从不允许自已夸大事实凭空臆想，我开始询问自已是否要让镜子继续给我一点虚幻的美好。

source: Maybe the greenish-white polish contained a chemical that, upon contact with glass, produced an optical distortion.
zh_cn: 可能那瓶浅绿色的光亮擦拭剂包含什么化学物质，只要这种化学物质和玻璃接触就会产生某些化学反应，使镜子中的形像有了改变。

source: Maybe the words "Miracle Polish" had caused cells in my brain to fire in a series of associations that affected the way I saw the reflected world.
zh_cn: 还可能是因为“神奇光亮”这个名字激活了我的大脑细胞，使我的脑中产生了某种联想，影响我判断镜中反射出来的另一个世界。

source: Whatever was happening, I knew that I needed another opinion, from someone I could trust.
zh_cn: 我知道，我需要一个我信任的人的意见。莫尼卡就是那个人，是能使我看清事实的那个人。

source: It was Monica who would set me straight, Monica who would know - Monica, who looked at the world through large, kind, skeptical eyes, darkened by many disappointments.
zh_cn: 莫尼卡会给我答案的，她的双眼既大又温柔，而且总是充满狐疑的目光。她会以自己的眼睛观察周围世界，虽然她的眼中时常由于失望而变得暗淡无光。

source: Monica arrived, as she did twice a week after work, once on Tuesdays and once, with her overnight bag, on Fridays, and as always when I greeted her I was careful not to look too closely at her, for Monica was likely to draw back and say "Is something wrong?" while raising her hand anxiously to her hair.
zh_cn: 莫尼卡如约而至。她每周两天来到我这里，一次是星期二，另一次是星期五。在星期五时，她会拿着一个小手提箱来到我家。和她打完招呼后，我尽量不去盯着她看。如果总盯着她看，她会退后一步，然后对我说，“有什么不对吗？”最后，她还会抬起手臂焦虑地摆弄一下头发。

source: She had a habit of assessing her looks mercilessly: she approved of her eyes, liked the shape of her wrists and the length of her fingers, put up with her calves, but was unforgiving about her thighs, her chin, her biggish knees, her hips, her upper arms.
zh_cn: 莫尼卡对自已外貌的苛求近乎于”无情“：她比较满意自已的眼睛、腰部、手指的长度，不太满意她的小腿，她最厌恶的地方是她的大腿、下巴、宽阔的膝盖、臀部和手臂。她皮肤上的一点点小瑕疵都会让她很挂心，她害怕蚊子的叮咬、皮疹、小面疱。

source: She fretted over any imperfection in her skin, like a mosquito bite or a heat rash or a tiny pimple, and often wore a hidden Band-Aid on a shoulder or calf, holding some ointment in place.
zh_cn: 她会在不看不见的地方为这些小瑕疵贴上一个创可贴，而且还要抹上一点儿药膏。

source: She wore long skirts that came down to her ankles, with plain blouses over plain white bras; she liked to mix dark greens, dark browns, and dark grays.
zh_cn: 她穿着盖住膝盖的长裙、简单的白色文胸外套着白色的衬衫，她还喜欢和墨绿色、棕黑色或黑灰色的服饰混搭。

source: Her shoulder-length brown hair was usually straight and parted in the middle, though sometimes she pulled it back and gathered it in a big dark clip that looked like an enormous insect.
zh_cn: 她经常梳着清汤挂面式的过肩棕色直发，并在中间分出了一道缝儿，虽然偶尔她也会把头发梳到脑后，并用大头夹固定在后面，看起来就像一只昆虫趴在脑后。

source: She inspected herself in front of any mirror, searching for flaws like a teen-age girl before a big party.
zh_cn: 只要看到镜子，她就会对自己镜中的形像审视一番，就像即将参加宴会的少女找找自已的缺点一样。

source: In fact she was forty and worked as an administrative assistant at the local high school.
zh_cn: 实际上，莫尼卡已经四十岁了，在当地高中做行政助理。

source: For years we had edged toward each other without moving all the way.
zh_cn: 几年的相处中，我们只是徐徐地向前移动，而不是大踏步地向前。

source: I liked how she hesitated a little before easing into a smile; liked the slight heaviness of her body, its faint awkwardness, its air of mild tiredness; liked how, when she took off her shoes and placed her feet on the hassock, she would wiggle her toes slowly and say, crinkling her eyes, "That feels really, really good."
zh_cn: 我喜欢她开怀微笑前的拘谨和犹豫；喜欢她身体的微微重量、稍稍的尴尬、轻微的疲倦；喜欢她脱下鞋子后，把双脚放在椅垫上，摆动脚趾，然后忽闪着眼睛温柔地说“真的是好舒服！”

source: Sometimes, in a certain light, when she held her body a certain way, I would see her as a woman for whom things had not worked out as she had hoped, a woman sinking slowly into defeat.
zh_cn: 有时她会倦缩着身子，这时我会把她看作是一个事事不如意、慢慢沉沦、即将失败的女人。

source: Then a burst of fellow feeling would come over me, for I knew how difficult it was, waiting for something better, waiting for something that was never going to happen.
zh_cn: 然后同样一种痛苦和悲哀会在我身体里升腾，因为我知道，等待情况变得更好、等待从不可能发生的事情是多么难受。

source: I took her upstairs to the oval mirror and switched on the light.
zh_cn: 我带着莫尼卡来到楼上的椭圆形镜子前并打开了灯。

source: "Look at that!" I said, and swept out my arm in a stagy way.
zh_cn: “看看那面镜子”，我说，然后不自然地晃了几下双臂。
